# 1. Берем готовую микро-операционку Linux, в которой уже установлена нужна версия Node.js
FROM node:20-alpine

# 2. Создаем папку /app внутри контейрена и готовим что будем работать в ней
WORKDIR /app

# 3. Сначало копируем только список зависимостей
COPY package*.json ./

# 4. Устанавливаем все нужные пакеты прямо внутри коробки
RUN npm install

# 5. Теперь копируем весь остальной код моего работать
COPY . .

# 6. Главная команда как запускать ботая когда контейнер включится
CMD ["node", "index.js"]